# Create a simple data-frame in Pandas

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33],
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

In [3]:
# return entire dataframe
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [8]:
# returns tghe name of all columns
df.columns

Index(['name', 'age', 'state', 'num_children', 'num_pets'], dtype='object')

In [6]:
# displays only the listed columns names
df[['name', 'age', 'state']]

    name  age       state
0   john   23        iowa
1   mary   78          dc
2  peter   22  california
3   jeff   19       texas
4   bill   45  washington
5   lisa   33          dc

In [9]:
# lists the 2-4 rows for the column 'name' ('name' is the 2nd parameter')
df.loc[2:4, 'name']

2    peter
3     jeff
4     bill
Name: name, dtype: object

In [11]:
# lists the 2-4 rows for the column 'name' and 'age' ('name' and 'age' are the 2nd parameter')
df.loc[2:4, ['name', 'age']]

    name  age
2  peter   22
3   jeff   19
4   bill   45

In [14]:
# returns rows based on the index location
df.iloc[:2] # first 2 rows

df.iloc[-2:] #last 2 rows

   name  age       state  num_children  num_pets
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [17]:
# return by index location (all rows, and the first column)
df.iloc[:,0]

0     john
1     mary
2    peter
3     jeff
4     bill
5     lisa
Name: name, dtype: object

In [25]:
# return by physical location (all rows in the age column)

# df.loc[:,'age']
df[['age']]

   age
0   23
1   78
2   22
3   19
4   45
5   33

## Conditional Selection

In [29]:
# returns all rows where the column 'age' is greater than 30

df[df['age']>30]
# df[df.age>30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

## Conditional Filtering

In [30]:
df[df['num_children'] < df['num_pets']]

   name  age  state  num_children  num_pets
1  mary   78     dc             2         4
3  jeff   19  texas             1         5

In [54]:
# older than 40 and own pets
df[ (df['age'] > 40) & (df['num_pets'] > 0) ]

   name  age state  num_children  num_pets
1  mary   78    dc             2         4

In [55]:
df[ (df['age'] > 40) | (df['num_pets'] > 0) ]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
3  jeff   19       texas             1         5
4  bill   45  washington             2         0

## Drop

In [60]:
# drops the named cloumns but does not remove from original dataframe
# axis refers to columns
df_after_drop = df.drop(["age", "num_children"], axis=1)

print(df_after_drop)
print("\n\n")
print(df)

    name       state  num_pets
0   john        iowa         0
1   mary          dc         4
2  peter  california         0
3   jeff       texas         5
4   bill  washington         0
5   lisa          dc         0



    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

## Describe

In [61]:
# only describes numerical data
df.describe()

             age  num_children  num_pets
count   6.000000      6.000000  6.000000
mean   36.666667      1.333333  1.500000
std    22.384518      0.816497  2.345208
min    19.000000      0.000000  0.000000
25%    22.250000      1.000000  0.000000
50%    28.000000      1.500000  0.000000
75%    42.000000      2.000000  3.000000
max    78.000000      2.000000  5.000000

## Column wise operations

In [66]:
# Mean
import numpy as np
df[['age', 'num_children', 'num_pets']].mean()
# df[['age', 'num_children', 'num_pets']].apply(lambda col :np.mean(col), axis=0)

age             36.666667
num_children     1.333333
num_pets         1.500000
dtype: float64

In [67]:
# Sum
df[['age', 'num_children', 'num_pets']].sum()
# df[['age', 'num_children', 'num_pets']].apply(lambda col :np.sum(col), axis=0)

age             220
num_children      8
num_pets          9
dtype: int64

In [68]:
# if column name is not specified, it is applied to every column (strings are concatanated)
df.sum()

name                    johnmarypeterjeffbilllisa
age                                           220
state           iowadccaliforniatexaswashingtondc
num_children                                    8
num_pets                                        9
dtype: object

## Row wise operations

In [70]:
# Sum of specified rows
df[['age', 'num_children', 'num_pets']].apply(lambda row :np.sum(row), axis=1)

0    25
1    84
2    22
3    25
4    47
5    34
dtype: int64

## Selection

In [77]:
# returns series
# good for when only returning 1 column
df['age']

0    23
1    78
2    22
3    19
4    45
5    33
Name: age, dtype: int64

In [75]:
# returns Dataframe
# good for when returning 1+ columns
df[['age', 'name']]

   age   name
0   23   john
1   78   mary
2   22  peter
3   19   jeff
4   45   bill
5   33   lisa

In [81]:
# apply a function to every row in the desired column
df[['age']].apply(lambda value: value*2)

   age
0   46
1  156
2   44
3   38
4   90
5   66

In [82]:
# changes the desired row in the original dataframe
df['age'] = df[['age']].apply(lambda value: value*2)
df

    name  age       state  num_children  num_pets
0   john   46        iowa             2         0
1   mary  156          dc             2         4
2  peter   44  california             0         0
3   jeff   38       texas             1         5
4   bill   90  washington             2         0
5   lisa   66          dc             1         0

In [85]:
# create a new column consisting of the product of 2 other columns
df['new_column'] = df['age'] * df['num_children']
df

    name  age       state  num_children  num_pets  new_column
0   john   46        iowa             2         0          92
1   mary  156          dc             2         4         312
2  peter   44  california             0         0           0
3   jeff   38       texas             1         5          38
4   bill   90  washington             2         0         180
5   lisa   66          dc             1         0          66

## Sorting

In [87]:
# Sort Ascending 
df.sort_values('age', ascending=True)

    name  age       state  num_children  num_pets  new_column
3   jeff   38       texas             1         5          38
2  peter   44  california             0         0           0
0   john   46        iowa             2         0          92
5   lisa   66          dc             1         0          66
4   bill   90  washington             2         0         180
1   mary  156          dc             2         4         312

In [89]:
# returns the rows where the column starts with the letter 'j'
df[df.apply(lambda row: row['name'].startswith('j'), axis = 1)]

   name  age  state  num_children  num_pets  new_column
0  john   46   iowa             2         0          92
3  jeff   38  texas             1         5          38

## Reshaping Dataframe

In [91]:
from collections import OrderedDict
from pandas import DataFrame
import pandas as pd
import numpy as np

table = OrderedDict((
    ("Item", ['Item0', 'Item0', 'Item1', 'Item1']),
    ('CType',['Gold', 'Bronze', 'Gold', 'Silver']),
    ('USD',  ['1$', '2$', '3$', '4$']),
    ('EU',   ['1€', '2€', '3€', '4€'])
))
d = DataFrame(table)
d

    Item   CType USD  EU
0  Item0    Gold  1$  1€
1  Item0  Bronze  2$  2€
2  Item1    Gold  3$  3€
3  Item1  Silver  4$  4€

In [92]:
p = d.pivot(index='Item', columns='CType', values='USD')
p

CType Bronze Gold Silver
Item
Item0     2$   1$    NaN
Item1    NaN   3$     4$